## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_log_group.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/route53/vpc-024adeef6279a5350"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_resource_policy.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53_resolver_logging_policy"
    }

  # aws_route53_resolver_query_log_config.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config" "route53_vpc_dns" {
      + arn             = (known after apply)
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + name            = "route53_vpc_dns"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_route53_resolver_query_log_config_association.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config_association" "route53_vpc_dns" {
      + id                           = (known after apply)
      + resolver_query_log_config_id = (known after apply)
      + resource_id                  = "vpc-024adeef6279a5350"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
